Revit 2027 API
BuiltInFailures.EditingFailures.ElementsWillBeDeleted Property
 Elements in [Design Option] will be deleted
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsWillBeDeleted { get; }
Public Shared ReadOnly Property ElementsWillBeDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsWillBeDeleted {
	FailureDefinitionId^ get ();
}
static member ElementsWillBeDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace